# Используем официальный образ Node.js с LTS-версией
FROM node:14-alpine
# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app
# Копируем файлы package.json и package-lock.json для установки зависимостей
COPY package*.json ./
# Устанавливаем зависимости
RUN npm install
# Копируем все файлы проекта внутрь контейнера
COPY . .
# Собираем приложение
RUN npm run build
# Если необходимо указать порт, который будет "открыт" в контейнере
EXPOSE 3000
# Команда для запуска приложения при старте контейнера
CMD ["npm", "start"]
